In [1]:
#Veri tutarsızlığının saptanması.
#Eksik verilerin tamamlanması.
#Aykırı değerlerin giderilmesi.

In [2]:
#BU KODDA ŞUNLARI GÖRECEZ;
#TEKRAR EDEN SATIRLARI SİLME.
#HARİTALAMA(MAPPİNG)
#VERİLERİN YERİNE DEĞER ATAMA.
#SATIR VE SUTUN İSİMLERİNİ DEĞİŞTİRME.

In [3]:
import pandas as pd

In [5]:
veri = pd.DataFrame({"a":["bir","iki"]*3,"b":[1,1,2,3,2,3]})
veri

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3
4  bir  2
5  iki  3

In [6]:
#Duplicated methodu satır tekrarını gösterir.
veri.duplicated() #True olanlar tekrar edenler.

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [8]:
#drop_duplicates tekrar eden değerleri kaldırır.
veri.drop_duplicates()

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3

In [11]:
#veriye bir sutun ekleyelim
veri["c"] = range(6)
veri

     a  b  c
0  bir  1  0
1  iki  1  1
2  bir  2  2
3  iki  3  3
4  bir  2  4
5  iki  3  5

In [12]:
veri.duplicated(["c"]) #c sutununda tekrar eder değer varmı bakıyoruz.

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [16]:
veri.duplicated(["a"]) #a sutununda tekrar eden değerleri gösterir.

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [17]:
veri

     a  b  c
0  bir  1  0
1  iki  1  1
2  bir  2  2
3  iki  3  3
4  bir  2  4
5  iki  3  5

In [18]:
veri.duplicated(["a","b"]) # hem a hem b de tekrar eden değerler

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [20]:
#Sondan başlayarak tekrar eden değerleri bulmak için keep = "last" methodu kullanılır.
veri.duplicated(["a","b"],keep = "last")

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [21]:
#HARİTALAMA ( MAPPİNG )

In [22]:
vs = pd.DataFrame({"İsim":["ali","can","nur","efe","ata"],
                  "Puan":[60,50,70,80,40]})
vs

  İsim  Puan
0  ali    60
1  can    50
2  nur    70
3  efe    80
4  ata    40

In [31]:
#her bir öğrencinin sınıfını gösteren bir sutun eklemek istiyoruz.
sinif = {"Ali":"A","Can":"A","Nur":"B","Efe":"B","Ata":"B"}

In [35]:
#vs veri setindeki isim sutununun baş harflerini büyültelim.
ad = vs["İsim"].str.capitalize() #bu method ile isim veri setindeki değerlerin baş harfleri büyür.
ad

0    Ali
1    Can
2    Nur
3    Efe
4    Ata
Name: İsim, dtype: object

In [36]:
#vs veri setine şube sutunu altında sinif değişkenlerimizi ekleyelim.
vs["Sube"] = ad.map(sinif)
vs

  İsim  Puan sube Sube
0  ali    60  NaN    A
1  can    50  NaN    A
2  nur    70  NaN    B
3  efe    80    B    B
4  ata    40  NaN    B

In [40]:
vs = vs.drop(columns=["Sube"])  #düzeltme yaptım burada.
vs

  İsim  Puan
0  ali    60
1  can    50
2  nur    70
3  efe    80
4  ata    40

In [42]:
vs["Sube"] = ad.map(sinif)
vs

  İsim  Puan Sube
0  ali    60    A
1  can    50    A
2  nur    70    B
3  efe    80    B
4  ata    40    B

In [43]:
#DEĞER ATAMA

In [44]:
nt = pd.Series([80,70,60,90])
nt

0    80
1    70
2    60
3    90
dtype: int64

In [45]:
import numpy as np

In [46]:
nt.replace(70,np.nan) #fillna yerine bu da kullanılabilir. #70 yerine nan değeri koyduk.

0    80.0
1     NaN
2    60.0
3    90.0
dtype: float64

In [47]:
nt.replace([70,60],[np.nan,0]) #70 yerine nan, 60 yerine 0 yazdık.

0    80.0
1     NaN
2     0.0
3    90.0
dtype: float64

In [49]:
nt.replace({90:100,60:0,80:12}) #çoklu değiştirmeyi böylede yapabiliriz. {}= sözlük için kullanılır.

0     12
1     70
2      0
3    100
dtype: int64

In [50]:
#SATIR VE SUTUN İSİMLENDİRME

In [52]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  index = [0,1,2],
                 columns = ["ali","efe","eda","can"])
df

   ali  efe  eda  can
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [62]:
#Satırların etiketini değiştirelim.
s = pd.Series(["bir","iki","uc"])
df.index = df.index.map(s)

In [65]:
df

     ali  efe  eda  can
NaN    0    1    2    3
NaN    4    5    6    7
NaN    8    9   10   11

In [69]:
df.rename(columns=str.upper)
df

     ali  efe  eda  can
NaN    0    1    2    3
NaN    4    5    6    7
NaN    8    9   10   11